app/views/units/index.html.erb


    g.column name: model_class.human_attribute_name(:unit_type), attribute: 'unit_type', allow_multiple_selection: false, custom_filter: Unit::TYPE.invert do |unit|
---
SELECT "units".* FROM "units"