app/views/units/show.html.erb

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]
---
 <!--  <dt><strong><%= model_class.human_attribute_name(:parent_id) %>:</strong></dt>
  <dd><%= @unit.parent_id.blank? ? "" : Unit.find_by(id:@unit.parent_id).name %></dd> -->