app/controllers/units_controller.rb

UPDATE "units" SET "name" = ?, "tcbd_khdh" = ?, "parent_id" = ?, "updated_at" = ? WHERE "units"."id" = 1  [["name", "unit1"], ["tcbd_khdh", ""], ["parent_id", 1], ["updated_at", Mon, 17 Jun 2019 11:17:06 CST +08:00]]
---
  def update
    respond_to do |format|
      if @unit.update(unit_params)